
DROP TABLE IF EXISTS `auto_scripts`;
CREATE TABLE `auto_scripts` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `auto_script_id` bigint DEFAULT NULL COMMENT '话术id',
  `auto_script_name` longtext COMMENT '话术名称',
  `auto_series` varchar(255) DEFAULT NULL COMMENT '车型',
  `script_tags` varchar(255) DEFAULT NULL COMMENT '话术对应标签',
  `auto_title` varchar(255) DEFAULT NULL COMMENT '话术标题',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=225 DEFAULT CHARSET=utf8mb4 ;

DROP TABLE IF EXISTS `auto_scripts_recommendation`;
CREATE TABLE `auto_scripts_recommendation` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `mobile` bigint DEFAULT NULL COMMENT '手机号',
  `dealer_id` varchar(255) DEFAULT NULL COMMENT '经销商ids,逗号分隔',
  `auto_script_id` varchar(255) DEFAULT NULL COMMENT '注释',
  `create_time` date DEFAULT NULL COMMENT '创建时间',
  `order` int DEFAULT NULL COMMENT '排序id',
  `attr1` varchar(255) DEFAULT NULL COMMENT '留白1',
  `attr2` varchar(255) DEFAULT NULL COMMENT '留白2',
  `attr3` varchar(255) DEFAULT NULL COMMENT '留白3',
  PRIMARY KEY (`id`),
  UNIQUE KEY `mobile` (`mobile`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 ;

DROP TABLE IF EXISTS `customer_journey`;
CREATE TABLE `customer_journey` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `mobile` bigint DEFAULT NULL COMMENT '手机号',
  `dealer_id` varchar(255) DEFAULT NULL COMMENT '经销商ids,逗号分隔',
  `event_id` varchar(255) DEFAULT NULL COMMENT '事件id',
  `event_info` longtext DEFAULT NULL COMMENT 'event_info',
  `event_time` date DEFAULT NULL COMMENT '事件发生时间',
  `create_time` date DEFAULT NULL COMMENT '创建时间',
  `attr1` varchar(255) DEFAULT NULL COMMENT '留白1',
  `attr2` varchar(255) DEFAULT NULL COMMENT '留白2',
  `attr3` varchar(255) DEFAULT NULL COMMENT '留白3',
  PRIMARY KEY (`id`),
  UNIQUE KEY `mobile` (`mobile`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 ;

DROP TABLE IF EXISTS `customer_journey_mapping`;
CREATE TABLE `customer_journey_mapping` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `event_id` bigint DEFAULT NULL COMMENT '事件id',
  `event_name` varchar(255) DEFAULT NULL COMMENT '事件名称',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8mb4 ;

DROP TABLE IF EXISTS `to_do_event`;
CREATE TABLE `to_do_event` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `mobile` varchar(255) DEFAULT NULL COMMENT '手机号',
  `dealer_id` varchar(255) DEFAULT NULL COMMENT '经销商ids,逗号分隔',
  `event_id` varchar(255) DEFAULT NULL COMMENT '事件id',
  `event_content` longtext COMMENT 'event_info',
  `create_time` date DEFAULT NULL COMMENT '创建时间',
  `attr1` varchar(255) DEFAULT NULL COMMENT '留白1',
  `attr2` varchar(255) DEFAULT NULL COMMENT '留白2',
  `attr3` varchar(255) DEFAULT NULL COMMENT '留白3',
  PRIMARY KEY (`id`),
  UNIQUE KEY `mobile` (`mobile`,`dealer_id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 ;

DROP TABLE IF EXISTS `to_do_event_mapping`;
CREATE TABLE `to_do_event_mapping` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `event_id` bigint DEFAULT NULL COMMENT '事件id',
  `event_name` varchar(255) DEFAULT NULL COMMENT '事件名称',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 ;

INSERT INTO `auto_scripts` (`id`, `auto_script_id`, `auto_script_name`, `auto_series`, `script_tags`, `auto_title`) VALUES
('1', '1', '全新名爵6采用全新升级的1.5T高功率发动机，动力高出同级30%，配合7速自动变速箱，6秒破百，秒杀同级 ！', 'MG6', '偏好', '同级最有爆发力的动力组合'),
('2', '2', '全新名爵6采用和宝马一样的电子挡杆，运动风格的设计，握起来特别舒适，操作起来也非常便利！', 'MG6', '偏好', '战机风格电子挡杆'),
('3', '3', '同级唯一能开关的运动排气，打开来就是超跑，关上后就是高级豪车，既能满足您自己对运动追求，又能随时照顾家人。', 'MG6', '偏好', '可开关EAV阀式运动排气'),
('4', '4', '同级罕见的三种高级动态补偿，三种转向手感和可变转向力矩，一台车开出三种性格，别人车的方向盘只能调上下，MG6还可以调轻重。', 'MG6', '偏好', 'EPS-Pro电动助力转向系统'),
('5', '5', '超越同级的电子差速锁，抑制转向不足，实现过山车般的高速稳定过弯。', 'MG6', '偏好', 'XDS弯道动态控制系统'),
('6', '6', '您按下这个按键，排气声浪、仪表图像可以瞬间改变，绝对可以让您感受一键入魂，一秒上头的感觉！', 'MG6', '偏好', 'SUPER SPORT超级运动模式'),
('7', '7', '我们这款座椅就是非常的与众不同，100mm超高侧翼和一体式头枕显得运动感十足，您坐上去不仅能够非常贴合，当您动态驾驶的时候还能提供强有力的支撑，这款座椅能让MG6配合您随身而动。', 'MG6', '偏好', '整体贴合式运动座椅'),
('8', '8', '偏向驾驶者的内饰布局，提供红黑和黄黑两种运动撞色内饰，营造极致的运动气质和非凡的运动品味，坐在车内可以瞬间点燃您的运动激情。', 'MG6', '偏好', '运动撞色内饰'),
('9', '9', '最新家族设计元素，更凸显动感和品质，59.6度空气刘海，极具美学设计，完美导流，噪音小，油耗低，舒适性好。', 'MG6', '偏好', '全新X热浪运动格栅'),
('10', '10', '想要更加运动？18寸运动轮毂、红色制动卡钳、立体悬浮大尾翼、空气动力学扩散器、双边双出运动尾排等组成的G-FORCE空气动力学组件打造专属您的气质，同时满满的下压力让您贴地飞行。', 'MG6', '偏好', 'G-FORCE空气动力学组件'),
('11', '11', '全新名爵6原装即可提供耀石黑、珠光白、赤焰红、丝绸灰，以及目前改装大热色赛道绿，每种车漆选择都可以让您成为整条gai最靓的仔！', 'MG6', '偏好', '个性化外观颜色'),
('12', '12', '好的音响首先要布局好，其次要硬件好，最后要调教好。全新MG6上配备的BOSE音响，9个扬声器高中低分布均匀，丝制球顶扬声器，再经大师调教，音乐一起来就像是在音乐厅的现场。', 'MG6', '偏好', 'BOSE音响'),
('13', '13', '全新名爵6配备了连ABB都没有的全新AR实景驾驶辅助，最直观的路线引导，超级炫酷，科技感十足。', 'MG6', '偏好', 'AR实景驾驶辅助'),
('14', '14', '全新名爵6配备的智能驾驶辅助系统，功能和特斯拉一模一样，这项功能在国内同级别车中也是独一无二的。', 'MG6', '偏好', 'L2级智能驾驶辅助'),
('15', '15', '全新名爵6可以远程解锁、远程调节空调温度，还可以完全用语音控制导航、音乐、车辆操作，出行更轻松。', 'MG6', '偏好', '斑马智行系统3.0'),
('16', '16', '同级最大尺寸的12.3寸全液晶仪表，信息显示更灵活更多样，还有4种不同主题风格，随意切换，领先同级别一个档次。', 'MG6', '偏好', '12.3寸全液晶仪表'),
('17', '17', '同级最有范的中控大屏，兼顾科技与便利的偏向主驾驶的悬浮设计，无需转头即可一目了然，同时触屏加按键的完美搭配，实现各种盲操，更好地专注于驾驶。', 'MG6', '偏好', '10.1英寸IPS魅彩高清悬浮大屏'),
('18', '18', '手机无线充电位于中控屏正下方，布局合适，易于取放，兼容市面上所有主流手机，让您摆脱“线”的束缚。', 'MG6', '偏好', '手机无线充电'),
('19', '19', '同级绝无仅有，上帝视角，360°无死角，自动开启，彻底解决停车困难。', 'MG6', '偏好', '360°全景影像'),
('20', '20', '系统自动检测前方行人，通过AR仪表显示和警示A柱盲区，清晰直观，大大降低因为盲区带来的行车危险，', 'MG6', '偏好', 'A柱盲区辅助'),
('21', '21', '全新名爵6拥有同级最宽车身，配合越级轴距，完全就是B级车的空间水平，无论您前排后排都宽敞舒适！', 'MG6', '偏好', '1848mm同级最宽车身'),
('22', '22', '全新名爵6采用同级独有的掀背式设计，开口特别大，后排座椅放倒后能接近1400L的容积，随便装点啥都没问题。', 'MG6', '偏好', '掀背式后备箱'),
('23', '23', '1.先生/女士 您好，我是上汽名爵品牌营销部的客服，看您之前关注过名爵车， 想邀请您做个简单的回访，耽误您1分钟时间可以吗?2.请问您是从哪里了解到我们名爵汽车的？ 3.您现在选购车辆的价位大概是多少呢？ 4.您用车的时间是最近？近两个月？下半年？ 5.最近我们店内正好有新车上市，就是最近特别火的新MG6，您可以到店看看，除了新车，我们的车价位从7万-16万都有。 6.您看您有兴趣吗？您大概什么时候有时间去店里？我可以按照您的地点帮您推荐一个离您最近的4S店。 7.店的地址慢点我发给您，请您保存一下，感谢您的接听，祝您生活愉快。', '', '用户状态', '首次外呼话术'),
('24', '24', '1.先生/女士 您好，我是上汽名爵品牌营销部的客服，看您之前去XX店看过名爵车，有个好消息要通知您一下，耽误您一分钟时间可以吗？ 2.是这样的，我们厂家这个月在整个XX区选了一家名爵4s店预热年末购车活动，名爵旗下的zs HS MG6 各有一台特价车名额，和员工内部购车价一致。不知道您关注的是哪款车呢？ 如客户已回复： 那太好了先生，这款车刚好包含在我们的特价车型中，而且是我们名爵性价比最高的一款车，销量也很好，您看您这两天有时间进店看一下吗？ 慢点门店的地址我会发给您，麻烦您查收一下，感谢您的接听，祝您生活愉快。', '', '用户状态', '邀约二次到店话术'),
('25', '25', '1.先生/女士 您好，我是上汽名爵品牌营销部的客服，耽误您一分钟对您做个回访可以吗？看您之前去XX店试驾过我们的XX车，想问您车想什么时候用呢？ 2.有个好消息要通知您一下，是这样的，我们厂家这个月在整个XX区选了一家名爵4s店进行特价车促销的活动 ，正好是您参与试驾的这家4S店，您看的车正好是这次活动的主推车型。您看您这两天有时间去店里看下嘛？ 3.慢点门店的地址我会发给您，麻烦您查收一下，感谢您的接听，祝您生活愉快。', '', '用户状态', '试驾后话术'),
('26', '26', '场景一: 用户反馈没时间做细节沟通 场景二: 用户反馈还需要考虑/跟家人商量 场景一和二通用话术：真是太遗憾了呢，这次活动这么合适，这是本年优惠力度最大的一次活动，后续您想找个便宜的机会要等很长时间了，而且这次厂家的目标就是要量，价格绝对给力，少则比店内基础上能多个1-2000元，上不封顶，现在还有特别合适的金融贷款政策。 而且现在关注的客户也比较多，后期车源如果紧张价格政策也就没现在这么好了，您说是吧？ 场景三: 用户对产品/品牌有疑虑 场景三话术：名爵品牌知名度低/道上跑的名爵车太少。答：名爵进入中国市场确实是比较晚的，在上汽旗下也就几年，错过了合资品牌在中国发展的黄金时期，但是在很多车企退市情况下，我们却达到了销量逆势增长，而且热销36个国家，比如英国澳大利亚,泰国等等。所以很快您就可以在马路上看到更多的名爵车了。 名爵售后服务部太少，后期维修保养费用高 目前名爵售后服务部其实还是很多的，地级市我们保证至少一家，而且我们经销商的数量以每年100家的速度增长。而且我们维修保养用的配件都是大厂家的，客户对我们售后的服务评价也一直很高。您来店里也可以看一下我们的售后部门，让您放心~ 场景四:用户反馈交通不便 场景四话术：我们可以安排经销商上门接送，或者上门看车，您不要有顾虑。 场景五 用户反馈出差在外，确认出差地点以及返回时间，或邀请其家人先来店里体验 场景五话术：如果您确实不方便，为了不让您错过这次机会，您可以安排家人或者朋友参加活动，最起码把政策先享受到，把礼品领到，这样保证您不吃亏，对吧？', '', '用户状态', '邀约抗拒话术'),
('27', '27', '1.先生/女士 您好，我是上汽名爵品牌营销部的客服，耽误您一分钟对您做个回访可以吗？看您之前去XX店看过我们的XX车，想问您车想什么时候用呢？ 2.有个好消息要通知您一下，是这样的，我们厂家这个月在整个XX区选了一家名爵4s店进行特价车促销的活动 ，正好是您参与试驾的这家4S店，您看的车正好是这次活动的主推车型。您看您这两天有时间去店里看下嘛？ 3.慢点门店的地址我会发给您，麻烦您查收一下，感谢您的接听，祝您生活愉快。', '', '用户状态', '活动邀约话术'),
('28', '28', '为了方便您到店，慢点我加下您微信，把地址给您发过去，请问手机号码就是您的微信号吗？', '', '语音标签', '添加用户微信话术'),
('29', '29', '1.请问您现在除了我们的XX车型以外，还有哪些其他的车型在做对比吗？您的购车方式是对的，买车是大事，总归要做些对比买的才能放心。 2.是这样的，我们名爵品牌的车有三大优势 第一我们是上汽的品牌，上汽是全球500强企业，非常有实力，后续用车和养车您可以绝对放心。相对的现在有些小品牌由于各种原因倒闭或者资产重组，导致已经购车的客户会遇见很多尴尬的事情，找不到地方维修，后续没有零配件供应，或者品牌承诺的车主福利无法兑现等等。 第二是我们的车质量口碑非常好，我们的零配件供应和上海大众，上海通用等等都是一样的供应商，所以零配件规格特别高，后续用车您不用担心质量问题。 第三是我们的车型目前都是出口的，比如英国，荷兰，泰国等等地区，我们名爵的保有量都非常大，而且国外卖的比国内要贵。所以我建议您还是到店看看实车或者深度试驾一下比较好，毕竟只是听我说，看到实车比较一下您才能放心，是吧？而且目前我们品牌在搞特价车的促销活动，3.您看的XX车型正好是促销车型。 4.您看您大概什么时候方便，我可以帮您安排一家您方便到达的4S店进行实车体验，顺便了解下目前的促销政策，您看好嘛？', '', '竞品意向客户', '用户有意向选择竞品话术'),
('30', '30', '1.原因为资金问题： 目前您无法购车的原因方便和我说一下嘛？资金问题：是这样的，我们目前可以提供很多金融服务，帮助您早日用车，低首付，0首付，低利率，0利率的金融产品我们都有，您如果感兴趣，我可以安排您这边4S店专业的销售顾问帮您介绍一下？ 2.原因为工作繁忙： 这样的，我们名爵品牌特意为了您这样的成功人士定制了在线看车的平台，让您不出门，在工作之余就可以在网上看车，随时随地打开手机就可以身临其境的感受我们的产品了，这样吧，我把链接发给您，您空下来看一下可以吗？ 3.原因为客户有车不着急： 能问下您现在开的是什么车吗？请问是SUV？轿车还是MPV？ （1）如结果为轿车 是这样的，轿车比较注重性价比和性能，我们这边有中型的SUV（HS），也是很多轿车的车主考虑置换或者增购的，主要原因是SUV视野比较好，内部空间比较大，可以满足您的更多的需求。 （2）如结果为SUV： 是这样的，SUV主要偏重的是通过性能和视野，我们这边有偏重性能的轿车（MG6），也有很多SUV车主考虑置换或者增购，开SUV时间长了，也想换换感觉，体验下操控和动力。我建议您有空可以到我们的展厅具体看一下，要么我帮您安排一家您交通比较方便的4S店可以吗？ ', '', '无购车需求', '用户无购车需求话术'),
('31', '31', '1.原因为资金问题： 目前您无法购车的原因方便和我说一下嘛？资金问题：是这样的，我们目前可以提供很多金融服务，帮助您早日用车，低首付，0首付，低利率，0利率的金融产品我们都有，您如果感兴趣，我可以安排您这边4S店专业的销售顾问帮您介绍一下？ 2.原因为工作繁忙： 这样的，我们名爵品牌特意为了您这样的成功人士定制了在线看车的平台，让您不出门，在工作之余就可以在网上看车，随时随地打开手机就可以身临其境的感受我们的产品了，这样吧，我把链接发给您，您空下来看一下可以吗？ 3.原因为客户有车不着急： 能问下您现在开的是什么车吗？请问是SUV？轿车还是MPV？ （1）如结果为轿车 是这样的，轿车比较注重性价比和性能，我们这边有中型的SUV（HS），也是很多轿车的车主考虑置换或者增购的，主要原因是SUV视野比较好，内部空间比较大，可以满足您的更多的需求。 （2）如结果为SUV： 是这样的，SUV主要偏重的是通过性能和视野，我们这边有偏重性能的轿车（MG6），也有很多SUV车主考虑置换或者增购，开SUV时间长了，也想换换感觉，体验下操控和动力。我建议您有空可以到我们的展厅具体看一下，要么我帮您安排一家您交通比较方便的4S店可以吗？ ', '', '暂不买车', '用户表明暂不买车话术'),
('32', '32', '1.原因为资金问题： 目前您无法购车的原因方便和我说一下嘛？资金问题：是这样的，我们目前可以提供很多金融服务，帮助您早日用车，低首付，0首付，低利率，0利率的金融产品我们都有，您如果感兴趣，我可以安排您这边4S店专业的销售顾问帮您介绍一下？ 2.原因为工作繁忙： 这样的，我们名爵品牌特意为了您这样的成功人士定制了在线看车的平台，让您不出门，在工作之余就可以在网上看车，随时随地打开手机就可以身临其境的感受我们的产品了，这样吧，我把链接发给您，您空下来看一下可以吗？ 3.原因为客户有车不着急： 能问下您现在开的是什么车吗？请问是SUV？轿车还是MPV？ （1）如结果为轿车 是这样的，轿车比较注重性价比和性能，我们这边有中型的SUV（HS），也是很多轿车的车主考虑置换或者增购的，主要原因是SUV视野比较好，内部空间比较大，可以满足您的更多的需求。 （2）如结果为SUV： 是这样的，SUV主要偏重的是通过性能和视野，我们这边有偏重性能的轿车（MG6），也有很多SUV车主考虑置换或者增购，开SUV时间长了，也想换换感觉，体验下操控和动力。我建议您有空可以到我们的展厅具体看一下，要么我帮您安排一家您交通比较方便的4S店可以吗？ ', '', '资金问题', '用户有资金问题话术'),
('33', '33', '1.询问用户买车用途： （1）如结果为代步：代步主要考虑的是性价比和油耗，我们不管哪个车型，都是在同级别当中配置最高，价格最合适的，油耗最省的ZS每公里才4毛钱，排量最大的HS也不过5毛出头。 （2）如结果为出去玩：我们的HS是最适合出去玩的车型，底盘离地间隙高，动力性能也很好，配置也非常丰富。 2. 能问下您家人（朋友）不推荐您购买名爵汽车的原因吗？ （1）原因为路上跑的少：名爵进入中国市场确实是比较晚的，在上汽旗下也就几年，错过了合资品牌在中国发展的黄金时期，但是在很多车企退市情况下，我们却达到了销量逆势增长，而且热销36个国家，比如英国澳大利亚,泰国等等。所以很快您就可以在马路上看到更多的名爵车了。 （2）原因为不考虑国产车：我们品牌是英国的牌子，三大件动力总成和通用是一样的，零件供应商也都是顶级供应商，与德系，美系和日系比的话同价位配置更高，性价比更合适。先生您应该过来看看，而且近期我们有厂家的粗细爱活动，厂家直接放价，一降到底，假如您看的这款车子优惠力度很大的话您是不是考虑一下？做个参考总是好的嘛！ （3）原因为名爵车用的双离合变速器，换挡有顿挫感：网上确实会有人这么说，您担心也是正常的，但是顿挫不顿挫得自己试过之后才知道呢！如果我们的车顿挫感很强的话我也不敢邀请您来店里试驾啊，您说对吧？而且双离合变速器啊换挡响应快操纵感强，比8AT省油。 （4）原因为名爵车油耗高：这跟车主驾驶习惯有关的，但是目前我没有收到说名爵耗油高的反馈呢，可以加您个微信吗？我们在朋友圈会发这些用车小知识，比如如何开车更省油。上个月我们MG6 20T还开出了5.6个油呢。 （5）原因为名爵车保值率太低：什么车买了不碰它都会贬值的，车买来是开的啊，不可能买两三年就卖了，它会陪伴你很长时间，应该更关注这个车的动力，配置等。您进店我们销售会向您介绍我们车的价值，保证您会觉得物超所值。 （6）原因为名爵车质量不好说：我们是集团性质的车企，与上汽的大众通用都是同一个品控平台，而且咱名爵车主的忠诚度很高，因为质量有保证，名爵车主的下一辆绝对还是名爵。别看某些国产车卖的多，比如吉利，但一般没有吉利车主介绍朋友买吉利车的，这您应该知道的吧。 （7）原因为名爵车优惠力度太小：抬价再降价的谁都会，别看优惠幅度，我们要看优惠后的落地价，性价比。名爵车很保值，不是今天降几万，明天降几万的。而且咱买车应该更注重车的价值呀，10万的车降到5万您敢买吗？说明它就值不到5万啊 （8）原因为负面反馈（服务不好或者经销商承诺不兑现造成未能购车）：先生，不好意思，我这边代表我们他们给您道个歉，实在对不起。您看这样行吗？我给您推荐一家服务特别好的星级经销商来对您服务，您看好嘛？ ', '', '家人/朋友反对', '家人/朋友反对话术'),
('34', '34', '1.原因为限牌城市客户无上牌名额： 您看这样行吗？您可以先去我们的4S店参加活动，拿到我们的活动政策，等您拿到上牌名额正好也能保留我们的优惠，两全其美您看好嘛？ 2.原因为客户不认可，觉得拿到额度再说： 那您看这样，为了让您及时享受到我们的优惠政策，买车不吃亏，我们定期跟您联系，及时把当期的活动内容告知您，您看可以吗？', '', '无购车资质', '用户表明无购车资质话术'),
('35', '35', '邀请客户为销售代表打分： 为了保证我们名爵品牌的服务质量，耽误您两分钟，请您对我们的服务进行一个打分可以吗？', '', '经销商问题', '经销商本身原因话术');


INSERT INTO `customer_journey_mapping` (`id`, `event_id`, `event_name`) VALUES
('2', '1', '点击认证二手车'),
('3', '2', '点击订购'),
('4', '3', '贷款查询行为'),
('5', '4', '点击试驾'),
('6', '5', '点击竞品车型'),
('7', '6', '点击名爵车型'),
('8', '7', '再次访问垂媒'),
('9', '8', '购车预算');

INSERT INTO `to_do_event_mapping` (`id`, `event_id`, `event_name`) VALUES
('2', '1', '流失预警'),
('3', '2', '战败挽回提醒'),
('4', '3', '意向级别变化提醒');